CSI API ETABS v1
cDCoTS_500_2000_R2018.SetOverwrite Method
 Sets the value of a concrete design overwrite item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOverwrite(
	string Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType.Objects
)
Function SetOverwrite (
	Name As String,
	Item As Integer,
	Value As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDCoTS_500_2000_R2018
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetOverwrite(Name,
	Item, Value, ItemType)
int SetOverwrite(
	String^ Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType::Objects
)
abstract SetOverwrite :
        Name : string *
        Item : int *
        Value : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType
Item
Type: System.Int32
 This is an integer between 1 and 13, inclusive, indicating the overwrite item considered.
Framing type
Live load reduction factor
Unbraced length ratio, Major
Unbraced length ratio, Minor
Effective length factor, K Major
Effective length factor, K Minor
Moment coefficient, Cm Major
Moment coefficient, Cm Minor
Nonsway moment factor, Db Major
Nonsway moment factor, Db Minor
Sway moment factor, Ds Major
Sway moment factor, Ds Minor
Consider Minimum Eccentricity
Value
Type: System.Double
 The value of the considered overwrite item.
 Framing type
0 = Program Default
1 = High Ductile
2 = Nominal Ductile
3 = Ordinary
4 = Non-sway
 Live load reduction factor
 Value >= 0; 0 means use program determined value
 Unbraced length ratio, Major
 Value >= 0; 0 means use program determined value
 Unbraced length ratio, Minor
 Value >= 0; 0 means use program determined value
 Effective length factor, K Major
 Value >= 0; 0 means use program determined value
 Effective length factor, K Minor
 Value >= 0; 0 means use program determined value
 Moment coefficient, Cm Major
 Value >= 0; 0 means use program determined value
 Moment coefficient, Cm Minor
 Value >= 0; 0 means use program determined value
 Nonsway moment factor, Db Major
 Value >= 0; 0 means use program determined value
 Nonsway moment factor, Db Minor
 Value >= 0; 0 means use program determined value
 Sway moment factor, Ds Major
 Value >= 0; 0 means use program determined value
 Sway moment factor, Ds Minor
 Value >= 0; 0 means use program determined value
 Consider Minimum Eccentricity
 0 = No
 Any other value = Yes
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the overwrite is set for the frame object specified by the Name item.
 If this item is Group, the overwrite is set for all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the overwrite is set for all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
See Also
Reference
cDCoTS_500_2000_R2018 Interface
ETABSv1 Namespace